Revit 2026 API

# RebarContainerItemDoesBarExistAtPosition Method

---

Checks whether a bar exists at the specified position.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DoesBarExistAtPosition(
	int barPosition
)
```
```vb
Public Function DoesBarExistAtPosition (
	barPosition As Integer
) As Boolean
```
```cpp
public:
bool DoesBarExistAtPosition(
	int barPosition
)
```
```fsharp
member DoesBarExistAtPosition :
        barPosition : int -> bool
```

#### Parameters

barPosition Int32
     A bar position index between 0 and NumberOfBarPositions-1.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPosition is not in the range [ 0, NumberOfBarPositions-1 ]. |

Returns true, unless the bar position is the first or last in the set and it is suppressed by IncludeFirstBar or IncludeLastBar.

#### Reference

RebarContainerItem Class

Autodesk.Revit.DB.Structure Namespace